pipe_porous/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     convMeltFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         3000;

deltaT          1;

writeControl    adjustableRunTime;

writeInterval   30;

purgeWrite      0;

writeFormat     binary;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

adjustTimeStep  yes;

maxCo           1;

maxDeltaT       1;

maxAlphaCo      1;

functions
{
//    #includeFunc residuals
//    #includeFunc streamlines

    fieldMinMax1
    {
        type                    fieldMinMax;
        libs                    ("libfieldFunctionObjects.so");
        writeControl            timeStep;
        writeInterval           1;
        writeToFile             yes;
        log                     yes;
        location                yes;
        mode                    magnitude;
        fields                  (U T);
    }
}

// ************************************************************************* //
